In [82]:
#importing required libraries


import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
from sklearn.linear_model import LinearRegression
import seaborn as sns

In [83]:
# importing dataset

data=pd.read_csv("/content/train (2).csv")

In [84]:
data.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [85]:
#finding Data type of the features

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [86]:

data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

EDA

In [87]:
# "PassengerId","Name","Cabin","Ticket" didn't play any role on dependent value and it having the sequence values
# So Drop that

data.drop(["PassengerId","Name","Cabin","Ticket","Age"] ,axis = 1, inplace = True)

In [88]:
# "Embarked","Sex" are cataegorical features so convertig the into numerical using one_hot_encoding

data_Emb=data[["Embarked"]]
data_Emb=pd.get_dummies(data_Emb,prefix="Emb",drop_first=True)
data_Emb.columns

Index(['Emb_Q', 'Emb_S'], dtype='object')

In [89]:
data_Gender=data[["Sex"]]
data_Gender=pd.get_dummies(data_Gender,prefix="Gender",drop_first=True)
data_Gender.columns

Index(['Gender_male'], dtype='object')

In [90]:
#concating the features

data=pd.concat([data,data_Emb,data_Gender],axis=1)
data

     Survived  Pclass     Sex  SibSp  ...  Embarked  Emb_Q Emb_S  Gender_male
0           0       3    male      1  ...         S      0     1            1
1           1       1  female      1  ...         C      0     0            0
2           1       3  female      0  ...         S      0     1            0
3           1       1  female      1  ...         S      0     1            0
4           0       3    male      0  ...         S      0     1            1
..        ...     ...     ...    ...  ...       ...    ...   ...          ...
886         0       2    male      0  ...         S      0     1            1
887         1       1  female      0  ...         S      0     1            0
888         0       3  female      1  ...         S      0     1            0
889         1       1    male      0  ...         C      0     0            1
890         0       3    male      0  ...         Q      1     0            1

[891 rows x 10 columns]

In [91]:
data.isnull().sum()

Survived       0
Pclass         0
Sex            0
SibSp          0
Parch          0
Fare           0
Embarked       2
Emb_Q          0
Emb_S          0
Gender_male    0
dtype: int64

In [92]:
# drop the Columuns 

data.drop(["Sex","Embarked"],axis=1,inplace=True)

In [93]:
data

     Survived  Pclass  SibSp  Parch     Fare  Emb_Q  Emb_S  Gender_male
0           0       3      1      0   7.2500      0      1            1
1           1       1      1      0  71.2833      0      0            0
2           1       3      0      0   7.9250      0      1            0
3           1       1      1      0  53.1000      0      1            0
4           0       3      0      0   8.0500      0      1            1
..        ...     ...    ...    ...      ...    ...    ...          ...
886         0       2      0      0  13.0000      0      1            1
887         1       1      0      0  30.0000      0      1            0
888         0       3      1      2  23.4500      0      1            0
889         1       1      0      0  30.0000      0      0            1
890         0       3      0      0   7.7500      1      0            1

[891 rows x 8 columns]

In [94]:
X=data.loc[:,["Fare","Pclass","SibSp","Parch","Emb_Q","Emb_S","Gender_male"]]
y=data.loc[:,["Survived"]]

In [95]:
# split the data

from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test= train_test_split(X,y)

In [96]:
#build the model

from sklearn.linear_model import LogisticRegression
logmodel = LogisticRegression()
logmodel.fit(X_train,y_train)

/usr/local/lib/python3.6/dist-packages/sklearn/utils/validation.py:760: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/usr/local/lib/python3.6/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [97]:
# predict the accuracy

from sklearn.metrics import accuracy_score
accuracy=accuracy_score(y_test,predictions)
accuracy

0.5381165919282511

In [98]:
from sklearn.metrics import classification_report
print(classification_report(y_test,predictions))

              precision    recall  f1-score   support

           0       0.63      0.65      0.64       142
           1       0.36      0.35      0.35        81

    accuracy                           0.54       223
   macro avg       0.50      0.50      0.50       223
weighted avg       0.53      0.54      0.54       223